{
    "bookName": "Sealed Nectar",
    "content": [
        {
            "section": "Location and nature of Arab Tribes‎",
            "sub_sections": [
                {
                    "sub_section": "Location of the Arabs",
                    "content": "Linguistically, the word “Arab” means deserts and waste barren land well-nigh waterless and treeless. Ever since the dawn of history, the Arabian Peninsula and its people have been called as such. The Arabian Peninsula is enclosed in the west by the Red Sea and Sinai, in the east by the Arabian Gulf, in the south by the Arabian Sea, which is an extension of the Indian Ocean, and in the north by old Syria and part of Iraq. The area is estimated between a million and a million and a quarter square miles. Thanks to its geographical position, the peninsula has always maintained great importance.. Considering its internal setting, it is mostly deserts and sandy places, which has rendered it inaccessible to foreigners and invaders, and allowed its people complete liberty and independence through the ages, despite the presence of two neighbouring great empires. Its external setting, on the other hand, caused it to be the centre of the old world and provided it with sea and land links with most nations at the time. Thanks to this strategic position the Arabian Peninsula had become the centre for trade, culture, religion and art."
                },
                {
                    "sub_section": "Arab Tribes",
                    "content": "Arab kinfolks have been divided according to lineage into three groups:Perishing Arabs: The ancient Arabs, of whose history little is known, and of whom were ‘Ad, Thamûd, Tasam, Jadis, Emlaq, and others.Pure Arabs: Who originated from the progeny of Ya‘rub bin Yashjub bin Qahtan. They were also called Qahtanian Arabs.Arabized Arabs: Who originated from the progeny of Ishmael. They were also called ‘Adnanian Arabs.The pure Arabs – the people of Qahtan – originally lived in Yemen and comprised many tribes, two of which were very famous: Himyar: The most famous of whose septs were Zaid Al-Jamhur, Quda‘a and Sakasic. Kahlan: The most famous of whose septs were Hamdan, Anmar, Tai’, Mudhhij, Kinda, Lakhm, Judham, Azd, Aws, Khazraj and the descendants of Jafna — the kings of old Syria. Kahlan septs emigrated from Yemen to dwell in the different parts of the Arabian Peninsula prior to the Great Flood (Sail Al-‘Arim of Ma’rib Dam), due to the failure of trade under the Roman pressure and domain on both sea and land trade routes following Roman occupation of Egypt and Syria. Naturally enough, the competition between Kahlan and Himyar led to the evacuation of the first and the settlement of the second in Yemen. THE EMIGRATING SEPTS OF KAHLAN CAN BE DIVIDED INTO FOUR GROUPS:Azd: Who, under the leadership of ‘Imran bin ‘Amr Muzaiqbâ’, wandered in Yemen, sent pioneers and finally headed northwards. Details of their emigration can be summed up as follows: Tha‘labah bin ‘Amr left his tribe Al-Azd for Hijaz and dwelt between Tha‘labiyah and Dhi Qar. When he gained strength, he headed for Madinah where he stayed. Of his seed are Aws and Khazraj, sons of Haritha bin Tha‘labah. Haritha bin ‘Amr, known as Khuza‘a, wandered with his folks in Hijaz until they came to Mar Az-Zahran. Later, they conquered the Haram, and settled in Makkah after having driven away its people, the tribe of Jurhum. ‘Imran bin ‘Amr and his folks went to ‘Oman where they established the tribe of Azd whose children inhabited Tihama and were known as Azd-of-Shanu’a. Jafna bin ‘Amr and his family, headed for Syria where he settled and initiated the kingdom of Ghassan who was so named after a spring of water, in Hijaz, where they s topped on their way to Syria. Lakhm and Judham: Of whom was Nasr bin Rabi‘a, father of Manadhira, Kings of Heerah. Banu Tai’: Who also emigrated northwards to settle by the so- called Aja and Salma Mountains which were consequently named as Tai’ Mountains. Kinda: Who dwelt in Bahrain but were expelled to Hadramout and Najd where they instituted a powerful government but not for long , for the whole tribe soon faded away. · Another tribe of Himyar, known as Quda‘a, also left Yemen and dwelt in Samawa semidesert on the borders of Iraq.The Arabized Arabs go back in ancestry to their great grandfather Abraham (Peace be upon him) from a town called “Ar” near Kufa on the west bank of the Euphrates in Iraq. Excavations brought to light great details of the town, Abraham’s family, and the prevalent religions and social circumstances. It is known that Abraham (Peace be upon him) left for Harran and then for Palestine, which he made headquarters for his Message. He wandered all over the area. When he went to E gypt, the Pharaoh tried to do evil to his wife Sarah, but Allâh saved her and the Pharaoh’s wicked scheme recoiled on him. He thus came to realize her strong attachment to Allâh, and, in acknowledgment of her grace, the Pharaoh rendered his daughter Hagar at Sarah’s service, but Sarah gave Hagar to Abraham as a wife. Abraham returned to Palestine where Hagar gave birth to Ishmael. Sarah became so jealous of Hagar that she forced Abraham to send Hagar and her baby away to a plantless valley on a small hill in Hijaz, by the Sacred House, exposed to the wearing of floods coming right and left. He chose for them a place under a lofty tree above Zamzam near the upper side of the Mosque in Makkah where neither people nor water was available, and went back to Palestine leaving with his wife and baby a leather case with some dates and a pot of water. Not before long, they ran out of both food and water, but thanks to Allâh’s favour water gushed forth to sustain them for sometime. The whole story of Zamzam spring is already known to everybody. Another Yemeni tribe – Jurhum the Second – came and lived in Makkah upon Hagar’s permission, after being said to have lived in the valleys around Makkah. It is mentioned in the Sahih Al-Bukhari that this tribe came to Makkah before Ishmael was a young man while they had passed through that valley long before this event. Abraham used to go to Makkah every now and then to see his wife and son. The number of these journeys is still unknown, but authentic historical resources spoke of four ones. Allâh, the Sublime, stated in the Noble Qur’ân that He had Abraham see, in his dream, that he slaughtered his son Ishmael, and therefore Abraham stood up to fulfill His Order: “Then, when they had both submitted themselves (to the Will of Allâh), and he had laid him prostrate on his forehead (or on the side of his forehead for slaughtering); and We called out to him: “O Abraham! You have fulfilled the dream (vision)!” Verily! Thus do we reward the Muhsinûn (good-doers, who perform good deeds totally for Allâh’s sake only, without any show off or to gain praise or fame, etc. and do them in accordance to Allâh’s Orders). Verily, that indeed was a manifest trial — and We ransomed him with a great sacrifice (i.e. a ram)” [37:103-107] It is mentioned in the Genesis that Ishmael was thirteen years older than his brother Ishaq. The sequence of the story of the sacrifice of Ishmael shows that it really happened before Ishaq’s birth, and that Allâh’s Promise to give Abraham another son, Ishaq, came after narration of the whole story. This story spoke of one journey – at least – before Ishmael became a young man. Al-Bukhari, on the authority of Ibn ‘Abbas, reported the other three journeys; a summary of which goes as follows: When Ishmael became a young man, he learned Arabic at the hand of the tribe of Jurhum, who loved him with great admiration and gave him one of their women as a wife, soon after his mother died. Having wanted to see his wife and son again, Abraham came to Makkah, Ishmael’s marriage, but he didn’t find him at home. He asked Ishmael’s wife about her husband and how they were doing. She complained of poverty, so he asked her to tell Ishmael to change his doorstep. Ishmael understood the message, divorced his wife and got married to the daughter of Mudad bin ‘Amr, chief of the tribe of Jurhum. Once more, Abraham came to see his son, but again didn’t find him at home. He asked his new wife the same previous question, to which she thanked Allâh. Abraham asked her to tell Ishmael to keep his doorstep (i.e. to keep her as wife) and went back to Palestine. A third time, Abraham came to Makkah to find Ishmael sharpening an arrow under a lofty tree near Zamzam. The meeting, after a very long journey of separation, was very touching for a father so affectionate and a so dutiful and righteous son. This time, father and son built Al-Ka‘bah and raised its pillars, and Abraham, in compliance with Allâh’s Commandment, called unto people to make pilgrimage to it. By the grace of Allâh, Ishmael had twelve sons from the daughter of Mudad, whose names were Nabet, Qidar, Edbael, Mebsham, Mishma’, Duma, Micha, Hudud, Yetma, Yetour, Nafis and Qidman, and who ultimately formed twelve tribes inhabiting Makkah and trading between Yemen, geographical Syria and Egypt. Later on, these tribes spread all over, and even outside, the peninsula. All their tidings went into oblivion except for the descendants of Nabet and Qidar. The Nabeteans – sons of Nabet – established a flourishing civilization in the north of Hijaz, they instituted a powerful government which spread out its domain over all neighbouring tribes, and made Petra their capital. Nobody dared challenge their authority until the Romans came and managed to eliminate their kingdom. After extensive research and painstaking investigation, Mr. Sulaiman An-Nadwi came to the conclusion that the Ghassanide kings, along with the Aws and Khazraj were not likely to be Qahtanians but rather Nabeteans. Descendants of Qidar, the son of Ishmael, lived long in Makkah increasing in number, of them issued ‘Adnan and son Ma‘ad, to whom ‘Adnanian Arabs traced back their ancestry. ‘Adnan is the twenty-first grandfather in the series of the Prophetic ancestry. It was said that whenever Prophet Muhammad Õáì Çááå Úáíå æÓáã spoke of his ancestry he would stop at ‘Adnan and say: “Genealogists tell lies” and did not go farther than him. A group of scholars, however, favoured the probability of going beyond ‘Adnan attaching no significance to the aforementioned Prophetic Hadith. They went on to say that there were exactly forty fathers between ‘Adnan and Abraham (Peace be upon them).Nizar, Ma‘ad’s only son , had four sons who branched out into four great tribes; Eyad, Anmar, Rabi‘a and Mudar. These last two sub-branched into several septs. Rabi‘a fathered Asad, ‘Anazah, ‘Abdul Qais, and Wa’il’s two sons (Bakr and Taghlib), Hanifa and many others. Mudar tribes branched out into two great divisions: Qais ‘Ailan bin Mudar and septs of Elias bin Mudar. Of Qais ‘Ailan were the Banu Saleem, Banu Hawazin, and Banu Ghatafan of whom descended ‘Abs, Zubyan, Ashja‘ and Ghani bin A‘sur. Of Elias bin Mudar were Tamim bin Murra, Hudhail bin Mudrika, Banu Asad bin Khuzaimah and septs of Kinana bin Khuzaimah, of whom came Quraish, the descendants of Fahr bin Malik bin An-Nadr bin Kinana. Quraish branched out into various tribes, the most famous of whom were Jumah, Sahm, ‘Adi, Makhzum, Tayim, Zahra and the three septs of Qusai bin Kilab: ‘Abdud-Dar bin Qusai, Asad bin ‘Abdul ‘Uzza bin Qusai and ‘Abd Manaf bin Qusai. ‘Abd Manaf branched out into four tribes: ‘Abd Shams, Nawfal, Muttalib and Hashim. It is, however, from the family of Hashim that Allâh selected Prophet Muhammad bin ‘Abdullah bin ‘Abdul-Muttalib bin Hashim (Peace be upon him). Prophet Muhammad (Peace be upon him) said: “Allâh selected Ishmael from the sons of Abraham, Kinana from the sons of Ishmael, Quraish from the sons of Kinana, Hashim from the sons of Quraish and He selected me from the sons of Hashim.” Al-‘Abbas bin ‘Abdul-Muttalib quoted the Messenger of Allâh (Peace be upon him) as saying: “Allâh created mankind and chose me from the best whereof, He chose the tribes and selected me from the best whereof; and He chose families and selected me from the best whereof. I am the very best in person and family.” Having increased in number, children of ‘Adnan, in pursuit of pastures and water, spread out over various parts of Arabia. The tribe of ‘Abdul Qais, together with some septs of Bakr bin Wa’il and Tamim, emigrated to Bahrain where they dwelt. Banu Hanifa bin Sa‘b bin Ali bin Bakr went to settle in Hijr, the capital of Yamama. All the tribes of Bakr bin Wa’il lived in an area of land which included Yamama, Bahrain, Saif Kazima, the sea shore, the outer borders of Iraq, Ablah and Hait.Most of the tribe of Taghlib lived in the Euphrates area while some of them lived with Bakr. Banu Tamim lived in Basra semi-desert. Banu Saleem lived in the vicinity of Madinah on the land stretching from Wadi Al-Qura to Khaibar onwards to the eastern mountains to Harrah. Thaqif dwelt in Ta’if and Hawazin east of Makkah near Autas on the road from Makkah to Basra. Banu Asad lived on the land east of Taimâ’ and west of Kufa, while family of Tai’ lived between Banu Asad and Taimâ’. They were five-day-walk far from Kufa. Zubyan inhabited the plot of and between Taimâ’ and Hawran. Some septs of Kinana lived in Tihama, while septs of Quraish dwelt in Makkah and its suburbs. Quraish remained completely disunited until Qusai bin Kilab managed to rally their ranks on honourable terms attaching major prominence to their status and importance. "
                }
            ]
        },
        {
            "section": "Rulership and Princeship among the Arabs",
            "content": "When talking about the Arabs before Islam,we deem it necessary to draw a mini-picture of the history of rulership, princeship, sectarianism and the religious dominations of the Arabs, so as to facilitate the understanding of emergent circumstances when Islam appeared. When the sun of Islam rose, rulers of Arabia were of two kinds: crowned kings, who were in fact not independent; and heads of tribes and clans, who enjoyed the same authorities and privileges possessed by crowned kings and were mostly independent, though some of whom could have shown some kind of submission to a crowned king. The crowned kings were only those of Yemen, Heerah and Ghassan. All other rulers of Arabia were non-crowned.",
            "sub_sections":[
                {
                    "sub_section": "Rulership in Yemen",
                    "content": "The folks of Sheba were one of the oldest nations of the pure Arabs, who lived in Yemen. Excavations at “Or” brought to light their existence twenty five centuries B.C. Their civilization flourished, and their domain spread eleven centuries B.C.It is possible to divide their ages according to the following estimation: The centuries before 650 B.C., during which their kings were called “Makrib Sheba”. Their capital was “Sarwah”, also known as “Khriba”, whose ruins lie in a spot, a day’s walk from the western side of “Ma’rib”. During this period, they started building the “Dam of Ma’rib” which had great importance in the history of Yemen. Sheba was also said to have had so great a domain that they had colonies inside and outside Arabia. From 650 B.C. until 115 B.C. During this era, they gave up the name “Makrib” and assumed the designation of “Kings of Sheba”. They also made Ma’rib their capital instead of Sarwah. The ruins of Ma’rib lie at a distance of sixty miles east of San‘a. From 115 B.C. until 300 A.D. During this period, the tribe of Himyar conquered the kingdom of Sheba and took Redan for capital instead of Ma’rib. Later on, Redan was called “Zifar”. Its ruins still lie on Mudawwar Mountain near the town of “Yarim”. During this period, they began to decline and fall. Their trade failed to a very great extent, firstly, because of the Nabetean domain over the north of Hijaz; secondly, because of the Roman superiority over the naval trade routes after the Roman conquest of Egypt, Syria and the north of Hijaz; and thirdly, because of the inter-tribal warfare. Thanks to the three above-mentioned factors, families of Qahtan were disunited and scatteredout. From 300 A.D. until Islam dawned on Yemen. This period witnessed a lot of disorder and turmoil. The great many and civil wars rendered the people of Yemen liable to foreign subjection and hence loss of independence. During this era, the Romans conquered ‘Adn and even helped the Abyssinians (Ethiopians) to occupy Yemen for the first time in 340 A.D., making use of the constant intra-tribal conflict of Hamdan and Himyar. The Abyssinian (Ethiopian) occupation of Yemen lasted until 378 A.D., whereafter Yemen regained its independence. Later on, cracks began to show in Ma’rib Dam which led to the Great Flood (450 or 451 A.D.) mentioned in the Noble Qur’ân. This was a great event which caused the fall of the entire Yemeni civilization and the dispersal of the nations living therein. In 523, Dhu Nawas, a Jew, despatched a great campaign against the Christians of Najran in order to force them to convert into Judaism. Having refused to do so, they were thrown alive into a big ditch where a great fire had been set. The Qur’ân referred to this event: “Cursed were the people of the ditch.” [85:4]This aroused great wrath among the Christians, and especially the Roman emperors, who not only instigated the Abyssinians (Ethiopians) against Arabs but also assembled a large fleet which helped the Abyssinian (Ethiopian) army, of seventy thousand warriors, to effect a second conquest of Yemen in 525 A.D., under the leadership of Eriat, who was granted rulership over Yemen, a position he held until he was assassinated by one of his army leaders, Abraha, who, after reconciliation with the king of Abyssinia, took rulership over Yemen and, later on, deployed his soldiers to demolish AlKa‘bah, and , hence, he and his soldiers came to be known as the “Men of the Elephant”After the “Elephant” incident, the people of Yemen, under the leadership of Ma‘dikarib bin Saif Dhu Yazin Al-Himyari, and through Persian assistance, revolted against the Abyssinian (Ethiopian) invaders, restored independence and appointed Ma‘dikarib as their king. However, Ma‘dikarib was assassinated by an Abyssinian (Ethiopian) he used to have him around for service and protection. The family of Dhu Yazin was thus deprived of royalty forever. Kisra, the Persian king, appointed a Persian ruler over San‘a and thus made Yeme n a Persian colony. Persian rulers maintained rulership of Yemen until Badhan, the last of them, embraced Islam in 638 A.D., thus terminating the Persian domain over Yemen. "
                },
                {
                    "sub_section": "Rulership in Heerah",
                    "content": "Ever since Korosh the Great (557-529 B.C.) united the Persians, they ruled Iraq and its neighbourhood. Nobody could shake off their authority until Alexander the Great vanquished their king Dara I and thus subdued the Persians in 326 B.C. Persian lands were thenceforth divided and ruled by kings known as “the Kings of Sects”, an era which lasted until 230 A.D. Meanwhile, the Qahtanians occupied some Iraqi territories, and were later followed by some ‘Adnanians who managed to share some parts of Mesopotamia with them.The Persians, under the leadership of Ardashir, who had established the Sasanian state in 226 A.D, regained enough unity and power to subdue the Arabs living in the vicinity of their kingdom, and force Quda‘a to leave for Syria , leaving the people of Heerah and Anbar under the Persian domain. During the time of Ardashir, Juzaima Alwaddah exercised rulership over Heerah, Rabi‘a and Mudar, and Mesopotamia. Ardashir had reckoned that it was impossible for him to rule the Arabs directly and prevent them from attacking his borders unless he appointed as king one of them who enjoyed support and power of his tribe. He had also seen that he could make use of them against the Byzantine kings who always used to harass him. At the same time, the Arabs of Iraq could face the Arabs of Syria who were in the hold of Byzantine kings. However, he deemed it fit to keep a Persian battalion under command of the king of Heerah to be used against those Arabs who might rebel against him. After the death of Juzaima around 268 A.D., ‘Amr bin ‘Adi bin Nasr Al-Lakhmi was appointed as king by the Persian King Sabour bin Ardashir. ‘Amr was the first of the Lakhmi kings who ruled Heerah until the Persians appointed Qabaz bin Fairuz in whose reign appeared someone called Mazdak, who called for dissoluteness in social life. Qabaz, and many of his subjects, embraced Mazdak’s religion and even called upon the king of Heerah, Al-Munzir bin Ma’ As-Sama’, to follow after. When the latter, because of his pride and self-respect, rejected their orders, Qabaz discharged him and nominated Harith bin ‘Amr bin Hajar Al-Kindi, who had accepted the Mazdaki doctrine. No sooner did Kisra Anu Shairwan succeed Qabaz than he, due to hatred of Mazdak’s philosophy, killed Mazdak and many of his followers, restored Munzir to the throne of Heerah and gave orders to summon under arrest Harith who sought refuge with Al-Kalb tribe where he spent the rest of his life. Sons of Al-Munzir bin Ma’ As-Sama’ maintained kingship a long time until An-Nu‘man bin Al-Munzir took over. Because of a calumny borne by Zaid bin ‘Adi Al-‘Abbadi, the Persian king got angry with An-Nu‘man and summoned him to his palace. An-Nu‘man went secretly to Hani bin Mas‘ud, chief of Shaiban tribe, and left his wealth and family under the latter’s protection, and then presented himself before the Persian king, who immediately threw him into prison where he perished. Kisra, then, appointed Eyas bin Qubaisa At-Ta’i as king of Heerah. Eyas was ordered to tell Hani bin Mas‘ud to deliver An-Nu‘man’s charge up to Kisra. No sooner than had the Persian king received the fanatically motivated rejection on the part of the Arab chief, he declared war against the tribe of Shaiban and mobilized his troops and warriors under the leadership of King Eyas to a place called Dhee Qar which witnessed a most furious battle wherein the Persians were severely routed by the Arabs for the first time in history. That was very soon after the birth of Prophet Muhammad Õáì Çááå Úáíå æÓáã eight months after Eyas bin Qubaisah’s rise to power over Heerah.After Eyas, a Persian ruler was appointed over Heerah, but in 632 A.D. the authority there returned to the family of Lukhm when Al-Munzir Al-Ma‘rur took over. Hardly had the latter’s reign lasted for eight months when Khalid bin Al-Waleed fell upon him with Muslim soldiers. "
                },
                {
                    "sub_section": "Rulership in Geographical Syria",
                    "content": "In the process of the tribal emigrations, some septs of Quda‘a reached the borders of Syria where they settled down. They belonged to the family of Sulaih bin Halwan, of whose offspring were the sons of Duj‘am bin Sulaih known as Ad-Duja‘ima. Such septs of Quda‘a were used by the Byzantines in the defence of the Byzantine borders against both Arab Bedouin raiders and the Persians, and enjoyed autonomy for a considerable phase of time which is said to have lasted for the whole second century A.D. One of their most famous kings was Zyiad bin Al-Habula. Their authority however came to an end upon defeat by the Ghassanides who were consequently granted the proxy rulership over the Arabs of Syria and had Dumat Al-Jandal as their headquarters, which lasted untilthe battle of Yarmuk in the year 13 A.H. Their last king Jabala bin Al-Aihum embraced Islam during the reign of the Chief of Believers, ‘Umar bin Al-Khattab (May Allah be pleased with him). "
                },
                {
                    "sub_section": "Rulership in Hijaz",
                    "content":"Ishmael (Peace be upon him) administered authority over Makkah as well as custodianship of the Holy Sanctuary throughout his lifetime. Upon his death, at the age of 137, two of his sons, Nabet and Qidar, succeeded him. Later on, their maternal grandfather, Mudad bin ‘Amr Al-Jurhumi took over, thus transferring rulership over Makkah to the tribe of Jurhum, preserving a venerable position, though very little authority for Ishmael’s sons due to their father’s exploits in building the Holy Sanctuary, a position they held until the decline of the tribe of Jurhum shortly before the rise of Bukhtanassar.The political role of the ‘Adnanides had begun to gain firmer grounds in Makkah, which could be clearly attested by the fact that upon Bukhtanassar’s first invasion of the Arabs in ‘Dhati ‘Irq’, the leader of the Arabs was not from Jurhum. Upon Bukhtanassar’s second invasion in 587 B.C., however, the ‘Adnanides were frightened out to Yemen, while Burmia An-Nabi fled to Syria with Ma‘ad, but when Bukhtanassar’s pressure lessened, Ma‘ad returned to Makkah to find none of the tribe of Jurhum except Jursham bin Jalhamah, whose daughter, Mu‘ana, was given to Ma‘ad as wife who, later, had a son by him named Nizar. On account of difficult living conditions and destitution prevalent in Makkah, the tribe of Jurhum began to ill-treat visitors of the Holy Sanctuary and extort its funds, which aroused resentment and hatred of the ‘Adnanides (sons of Bakr bin ‘Abd Munaf bin Kinana) who, with the help of the tribe of Khuza‘a that had come to settle in a neighbouring area called Marr Az-Zahran, invaded Jurhum and frightened them out of Makkah leaving rulership to Quda‘a in the middle of the second century A.D. Upon leaving Makkah, Jurhum filled up the well of Zamzam, levelled its place and buried a great many things in it. ‘Amr bin Al-Harith bin Mudad Al-Jurhumi was reported by Ibn Ishaq, the wellknown historian, to have buried the two gold deer together with the Black Stone as well as a lot of jewelry and swords in Zamzam, prior to their sorrowful escape to Yemen. Ishmael’s epoch is estimated to have lasted for twenty centuries B.C., which means that Jurhum stayed in Makkah for twenty-one centuries and held rulership there for about twenty centuries. Upon defeat of Jurhum, the tribe of Khuza‘a monopolized rulership over Makkah. Mudar tribes, however, enjoyed three privileges: The First: Leading pilgrims from ‘Arafat to Muzdalifah and then from Mina to the ‘Aqabah Stoning Pillar. This was the authority of the family of Al-Ghawth bin Murra, one of the septs of Elias bin Mudar, who were called ‘Sofa’. This privilege meant that the pilgrims were not allowed to throw stones at Al-‘Aqabah until one of the ‘Sofa’ men did that. When they had finished stoning and wanted to leave the valley of Mina, ‘Sofa’ men stood on the two sides of Al-‘Aqabah and nobody would pass that position until the men of ‘Sofa’ passed and cleared the way for the pilgrims. When Sofa perished, the family of Sa‘d bin Zaid Manat from Tamim tribe took over. The Second: Al-Ifadah (leaving for Mina after Muzdalifah) on sacrifice morning, and this was the responsibility of the family of Adwan. The Third: Deferment of the sacred months, and this was the responsibility of the family of Tamim bin ‘Adi from Bani Kinana. Khuza‘a’s reign in Makkah lasted for three hundred years, during which, the ‘Adnanides spread all over Najd and the sides of Bahrain and Iraq, while small septs of Quraish remained on the sides of Makkah; they were Haloul, Harum and some families of Kinana. They enjoyed no privileges in Makkah or in the Sacred House until the appearance of Qusai bin Kilab, whose father is said to have died when he was still a baby, and whose mother was subsequently married to Rabi‘a bin Haram, from the tribe of Bani ‘Udhra. Rabi‘a took his wife and her baby to his homeland on the borders of Syria. When Qusai became a young man, he returned to Makkah, which was ruled by Halil bin Habsha from Khuza‘a, who gave Qusai his daughter, Hobba, as wife. After Halil’s death, a war between Khuza‘a and Quraish broke out and resulted in Qusai’s taking hold of Makkah and the Sacred House. "
                },
                {
                    "sub_section": "The Reasons of this war have been illustrated in three versions",
                    "content": "The First: Having noticed the spread of his offspring, increase of his property and exalt of his honour after Halil’s death, Qusai found himself more entitled to shoulder responsibility of rulership over Makkah and custodianship of the Sacred House than the tribes of Khuza‘a and Bani Bakr. He also advocated that Quraish were the chiefs of Ishmael’s descendants. Therefore he consulted some men from Quraish and Kinana concerning his desire to evacuate Khuza‘a and Bani Bakr from Makkah. They took a liking to his opinion and supported him. The Second: Khuza‘a claimed that Halil requested Qusai to hold custodianship of Al-Ka‘bah and rulership over Makkah after his death. The Third: Halil g ave the right of Al-Ka‘bah service to his daughter Hobba and appointed Abu Ghabshan Al-Khuza‘i to function as her agent whereof. Upon Halil’s death, Qusai bought this right for a leather bag of wine, which aroused dissatisfaction among the men of Khuza‘a a nd they tried to keep the custodianship of the Sacred House away from Qusai. The latter, however, with the help of Quraish and Kinana, managed to take over and even to expel Khuza‘a completely from Makkah.Whatever the truth might have been, the whole affair resulted in the deprivation of Sofa of their privileges, previously mentioned, evacuation of Khuza‘a and Bakr from Makkah and transfer of rulership over Makkah and custodianship of the Holy Sanctuary to Qusai, after fierce wars between Qusai and Khuza‘a inflicting heavy casualties on both sides,reconciliation and then arbitration of Ya‘mur bin ‘Awf, from the tribe of Bakr, whose judgement entailed eligibility of Qusai’s rulership over Makkah and custodianship of the Sacred House, Qusai’s irresponsibility for Khuza‘a’s blood shed, and imposition of blood money on Khuza‘a. Qusai’s reign over Makkah and the Sacred House began in 440 A.D. and allowed him, and Quraish afterwards, absolute rulership over Makkah and undisputed custodianship of the Sacred House to which Arabs from all over Arabia came to pay homage. Qusai brought his kinspeople to Makkah and allocated it to them, allowing Quraish some dwellings there. An-Nus’a, the families of Safwan, Adwan, Murra bin ‘Awf preserved the same rights they used to enjoy before his arrival. A significant achievement credited to Qusai was the establishment of An-Nadwa House (an assembly house) on the northern side of Al-Ka‘bah Mosque, to serve as a meeting place for Quraish. This very house had benefited Quraish a lot because it secured unity of opinions amongst them and cordial solution to their problem. QUSAI HOWEVER ENJOYED THE FOLLONG PRIVILEGED OF LEADERSHIP AND HONOUR:1. Presiding over An-Nadwa House meetings where consultations relating to serious issues were conducted, and marriage contracts were announced. 2. The Standard: He monopolized in his hand issues relevant to war launching. 3. Doorkeeping of Al-Ka‘bah: He was the only one eligible to open its gate, and was responsible for its service and protection. 4. Providing water for the Pilgrims: This means that he used to fill basins sweetened by dates and raisins for the pilgrims to drink. 5. Feeding Pilgrims: This means making food for pilgrims who could not afford it. Qusai even imposed on Quraish annual land tax, paid at the season of pilgrimage, for food.It is noteworthy however that Qusai singled out ‘Abd Manaf, a son of his, for honour and prestige though he was not his elder son (‘Abd Ad-Dar was), and entrusted him with such responsibilities as chairing of An-Nadwa House, the standard, the doorkeeping of Al-Ka‘bah, providing water and food for pilgrims. Due to the fact that Qusai’s deeds were regarded as unquestionable and his orders inviolable, his death gave no rise to conflicts among his sons, but it later did among his grand children, for no sooner than ‘Abd Munaf had died, his sons began to have rows with their cousins —sons of ‘Abd Ad-Dar, which would have given rise to dissension and fighting among the whole tribe of Quraish, had it not been for a peace treaty whereby posts were reallocated so as to preserve feeding and providing water for pilgrims for the sons of ‘Abd Munaf; while An-Nadwa House, the flag and the doorkeeping of Al-Ka‘bah were maintained for the sons of ‘Abd Ad-Dar. The sons of ‘Abd Munaf, however, cast the lot for their charge, and consequently left the charge of food and water giving to Hashim bin ‘Abd Munaf, upon whose death, the charge was taken over by a brother of his called Al-Muttalib bin ‘Abd Manaf and afterwards by ‘Abd Al-Muttalib bin Hashim, the Prophet’s grandfather, whose sons assumed this position until the rise of Islam, during which ‘Abbas bin ‘Abdul-Muttalib was in charge. Many other posts were distriamong people of Quraish for establishing the pillars of a new democraticpetite state with government offices and councils similar to those of today. Enlisted as follows aresome of these posts. 1. Casting the lots for the idols was allocated to Bani Jumah. 2. Noting of offers and sacrifices, settlement of disputes and relevant issues were to lie in the hands of Bani Sahm. 3. Consultation was to go to Bani Asad. 4. Organization of blood-money and fines was with Bani Tayim. 155. Bearing the national banner was with Bani Omaiyah. 6. The military institute, footmen and cavalry would be Bani Makhzum’s responsibility. 7. Bani ‘Adi would function as foreign mediators."
                },
                {
                    "sub_section": "Rulership in Pan-Arabia",
                    "content": "We have previously mentioned the Qahtanide and ‘Adnanide emigrations, and division of Arabia between these two tribes. Those tribes dwelling near Heerah were subordinate to the Arabian king of Heerah, while those dwelling in the Syrian semi-desert were under domain of the Arabian Ghassanide king, a sort of dependency that was in reality formal rather than actual. However, those living in the hinder deserts enjoyed full autonomy. These tribes in fact had heads chosen by the whole tribe which was a demi-government based on tribal solidarity and collective interests in defence of land and property. Heads of tribes enjoyed dictatorial privileges similar to those of kings, and were rendered full obedience and subordination in both war and peace. Rivalry among cousins for rulership, however, often drove them to outdo one another in entertaining guests, affecting generosity, wisdom and chivalry for the sole purpose of outranking their rivals, and gaining fame among people especially poets who were the official spokesmen at the time. Heads of tribes and masters had special claims to spoils of war such as the quarter of the spoils, whatever he chose for himself, or found on his way back or even the remaining indivisible spoils. "
                },
                {
                    "sub_section": "The political situation",
                    "content":"The three Arab regions adjacent to foreigners suffered great weakness and inferiority. The people there were either masters or slaves, rulers or subordinates. Masters, especially the foreigners, had claim to every advantage; slaves had nothing but responsibilities to shoulder. In other words, arbitrary autocratic rulership brought about encroachment on the rights of subordinates, ignorance, oppression, iniquity, injustice and hardship, and turning them into people groping in darkness and ignorance, viz., fertile land which rendered its fruits to the rulers and men of power to extravagantly dissipate on their pleasures and enjoyments, whims and desires, tyranny and aggression. The tribes living near these regions were fluctuating between Syria and Iraq, whereas those living inside Arabia were disunited and governed by tribal conflicts and racial and religious disputes. They had neither a king to sustain their independence nor a supporter to seek advice from, or depend upon, in hardships. The rulers of Hijaz, however, were greatly esteemed and respected by the Arabs, and were considered as rulers and servants of the religious centre. Rulership of Hijaz was, in fact, a mixture of secular and official precedence as well as religious leadership. They ruled among the Arabs in the name of religious leadership and always monopolized the custodianship of the Holy Sanctuary and its neighbourhood. They looked after the interests of Al-Ka‘bah visitors and were in charge of putting Abraham’s code into effect. They even had such offices and departments like those of the parliaments of today. However, they were too weak to carry the heavy burden, as this evidently came to light during the Abyssinian (Ethiopian) invasion."
                }
            ]
        },
        {
            "section": "Religions of the Arabs",
            "sub_sections": [
                {
                    "sub_section": "Religions of the Arab",
                    "content":"Most of the Arabs had complied with the call of Ishmael (Peace be upon him) , and professed thereligion of his father Abraham (Peace be upon him) They had worshipped Allâh, professed HisOneness a nd followed His religion a long time until they forgot part of what they had been remindedof. However, they still maintained such fundamental beliefs such as monotheism as well as variousother aspects of Abraham’s religion, until the time when a chief of Khuza‘a, namely ‘Amr bin Luhai,who was renowned for righteousness, charity, reverence and care for religion, and was grantedunreserved love and obedience by his tribesmen, came back from a trip to Syria where he sawpeople worship idols, a phenomenon he approved of and believed it to be righteous since Syria wasthe locus of Messengers and Scriptures, he brought with him an idol (Hubal) which he placed in themiddle of Al-Ka‘bah and summoned people to worship it. Readily enough, paganism spread all overMakkah and, thence, to Hijaz, people of Makkah being custodians of not only the Sacred House butthe whole Haram as well. A great many idols, bearing different names, were introduced into thearea.An idol called ‘Manat’, for instance, was worshipped in a place known as Al-Mushallal near Qadid onthe Red Sea. Another, ‘Al-Lat’ in Ta’if, a third, ‘Al-‘Uzza’ in the valley of Nakhlah, and so on and soforth. Polytheism prevailed and the number of idols increased everywhere in Hijaz. It was evenmentioned that ‘Amr bin Luhai, with the help of a jinn companion who told him that the idols ofNoah’s folk – Wadd, Suwa‘, Yaguth, Ya‘uk and Nasr – were buried in Jeddah, dug them out and tookthem to Tihama. Upon pilgrimage time, the idols were distributed among the tribes to take backhome. Every tribe, and house, had their own idols, and the Sacred House was also overcrowded withthem. On the Prophet’s conquest of Makkah, 360 idols were found around Al-Ka‘bah. He broke themdown and had them removed and burned up.Polytheism and worship of idols became the most prominent feature of the religion of pre-IslamArabs despite alleged profession of Abraham’s religion.Traditions and ceremonies of the worship of their idols had been mostly created by ‘Amr bin Luhai,and were deemed as good innovations rather than deviations from Abraham’s religion. Somefeatures of their worship of idols were:Self-devotion to the idols, seeking refuge with them, acclamation of their names, calling fortheir help in hardship, and supplication to them for fulfillment of wishes, hopefully that theidols (i.e., heathen gods) would mediate with Allâh for the fulfillment of people’s wishes.Performing pilgrimage to the idols, circumrotation round them, self-abasement and evenprostrating themselves before them.Seeking favour of idols through various kinds of sacrifices and immolations, which ismentioned in the Qur’ânic verses:“And that which is sacrificed (slaughtered) on An-Nusub (stone-altars)” [5:3]Allâh also says:· “Eat not (O believers) of that (meat) on which Allâh’s Name has not been pronounced (atthe time of the slaughtering of the animal).” [6:121]· Consecration of certain portions of food, drink, cattle, and crops to idols. Surprisinglyenough, portions were also consecrated to Allâh Himself, but people often found reasons totransfer parts of Allâh’s portion to idols, but never did the opposite. To this effect, theQur’ânic verses go:· “And they assign to Allâh a share of the tilth and cattle which He has created, and theysay: ‘This is for Allâh according to their pretending, and this is for our (Allâh’s so-called)partners.’ But the share of their (Allâh’s so-called) ‘partners’, reaches not Allâh, while theshare of Allâh reaches their (Allâh’s so-called) ‘partners’. Evil is the way they judge.”[6:136]· Currying favours with these idols through votive offerings of crops and cattle, to whicheffect, the Qur’ân goes:· “And according to their pretending, they say that such and such cattle and crops areforbidden, and none should eat of them except those whom we allow. And (they say) thereare cattle forbidden to be used for burden or any other work, and cattle on which (atslaughtering) the Name of Allâh is not pronounced; lying against Him (Allâh).” [6:138]· Dedication of certain animals (such as Bahira, Sa’iba, Wasila and Hami) to idols, whichmeant sparing such animals from useful work for the sake of these heathen gods. Bahira, asreported by the well-known historian, Ibn Ish, was daughter of Sa’iba which was a femalecamel that gave birth to ten successive female animals, but no male ones, was set free andforbidden to yoke, burden or being sheared off its wool, or milked (but for guests to drinkfrom); and so was done to all her female offspring which were given the name ‘Bahira’, afterhaving their ears slit. The Wasila was a female sheep which had ten successive femaledaughters in five pregnancies. Any new births from this Wasila were assigned only for malepeople. The Hami was a male camel which produced ten progressive females, and was thussimilarly forbidden. In mention of this, the Qur’ânic verses go:· “Allâh has not instituted things like Bahira ( a she-camel whose milk was spared for theidols and nobody was allowed to milk it) or a Sa’iba (a she camel let loose for free pasturefor their false gods, e.g. idols, etc., and nothing was allowed to be carried on it), or a Wasila(a she-camel set free for idols because it has given birth to a she-camel at its first deliveryand then again gives birth to a she-camel at its second delivery) or a Hâm (a stallion-camelfreed from work for their idols, after it had finished a number of copulations assigned for it,all these animals were liberated in honour of idols as practised by pagan Arabs in the pre-Islamic period). But those who disbelieve, invent lies against Allâh, and most of them haveno understanding.” [5:103]Allâh also says:· “And they say: What is in the bellies of such and such cattle (milk or foetus) is for ourmales alone, and forbidden to our females (girls and women), but if it is born dead, then allhave shares therein.” [6:139]It has been authentically reported that such superstitions were first invented by ‘Amr bin Luhai.The Arabs believed that such idols, or heathen gods, would bring them nearer to Allâh, lead them toHim, and mediate with Him for their sake, to which effect, the Qur’ân goes:· “We worship them only that they may bring us near to Allâh.” [39:3], and“And they worship besides Allâh things that hurt them not, nor profit them, and they say:These are our intercessors with Allâh.” [10:18]Another divinatory tradition among the Arabs was casting of Azlam (i.e. featherless arrows whichwere of three kinds: one showing ‘yes’, another ‘no’ and a third was blank) which they used to do incase of serious matters like travel, marriage and the like. If the lot showed ‘yes’, they would do, if‘no’, they would delay for the next year. Other kinds of Azlam were cast for water, blood-money orshowed ‘from you’, ‘not from you’, or ‘Mulsaq’ (consociated). In cases of doubt in filiation they wouldresort to the idol of Hubal, with a hundred-camel gift, for the arrow caster. Only the arrows wouldthen decide the sort of relationship.If the arrow showed (from you), then it was decided that thechild belonged to the tribe; if it showed (from others), he would then be regarded as an ally, but if(consociated) appeared, the person would retain his position but with no lineage or alliance contract.This was very much like gambling and arrow-shafting whereby they used to divide the meat of thecamels they slaughtered according to this tradition.Moreover, they used to have a deep conviction in the tidings of soothsayers, diviners andastrologers. A soothsayer used to traffic in the business of foretelling future events and claimknowledge of private secrets and having jinn subordinates who would communicate the news tohim. Some soothsayers claimed that they could uncover the unknown by means of a granted power,while other diviners boasted they could divulge the secrets through a cause-and-effect-inductiveprocess that would lead to detecting a stolen commodity, location of a theft, a stray animal, and thelike. The astrologer belonged to a third category who used to observe the stars and calculate theirmovements and orbits whereby he would foretell the future. Lending credence to this newsconstituted a clue to their conviction that attached special significance to the movements ofparticular stars with regard to rainfall.The belief in signs as betokening future events, was, of course common among the Arabians. Somedays and months and particular animals were regarded as ominous. They also believed that the soulof a murdered person would fly in the wilderness and would never rest at rest until revenge wastaken. Superstition was rampant. Should a deer or bird, when released, turn right then what theyembarked on would be regarded auspicious, otherwise they would get pessimistic and withhold frompursuing it.People of pre-Islamic period, whilst believing in superstition, they still retained some of theAbrahamic traditions such as devotion to the Holy Sanctuary, circumambulation, observance ofpilgrimage, the vigil on ‘Arafah and offering sacrifices, all of these were observed fully despite someinnovations that adulterated these holy rituals. Quraish, for example, out of arrogance, feeling ofsuperiority to other tribes and pride in their custodianship of the Sacred House, would refrain fromgoing to ‘Arafah with the crowd, instead they would stop short at Muzdalifah. The Noble Qur’ânrebuked and told them:· “Then depart from the place whence all the people depart.” [2:199]Another heresy, deeply established in their social tradition, dictated that they would not eat driedyoghurt or cooked fat, nor would they enter a tent made of camel hair or seek shade unless in ahouse of adobe bricks, so long as they were committed to the intention of pilgrimage. They also, outof a deeply-rooted misconception, denied pilgrims, other than Makkans, access to the food they hadbrought when they wanted to make pilgrimage or lesser pilgrimage.They ordered pilgrims coming from outside Makkah to circumambulate Al-Ka‘bah in Quraish uniformclothes, but if they could not afford them, men were to do so in a state of nudity, and women withonly some piece of cloth to hide their groins. Allâh says in this concern:· “O Children of Adam! Take your adornment (by wearing your clean clothes), while praying[and going round (the Tawaf of) the Ka‘bah. [7:31]If men or women were generous enough to go round Al-Ka‘bah in their clothes, they had to discardthem after circumambulation for good.When the Makkans were in a pilgrimage consecration state, they would not enter their housesthrough the doors but through holes they used to dig in the back walls. They used to regard suchbehaviour as deeds of piety and god-fearing. This practice was prohibited by the Qur’ân:· “It is not Al-Birr (piety, righteousness, etc.) that you enter the houses from the back butAl-Birr (is the quality of the one) who fears Allâh. So enter houses through their properdoors, and fear Allâh that you may be successful.” [2:189]doors, and fear Allâh that you may be successful.” [2:189]Such was the religious life in Arabia, polytheism, idolatry, and superstition.Judaism, Christianity, Magianism and Sabianism, however, could find their ways easily into Arabia.The migration of the Jews from Palestine to Arabia passed through two phases: first, as a result ofthe pressure to which they were exposed, the destruction of the their temple, and taking most ofthem as captives to Babylon, at the hand of the King Bukhtanassar. In the year B.C. 587 some Jewsleft Palestine for Hijaz and settled in the northern areas whereof. The second phase started with theRoman occupation of Palestine under the leadership of Roman Buts in 70 A.D. This resulted in a tidalwave of Jewish migration into Hijaz, and Yathrib, Khaibar and Taima’, in particular. Here, they madeproselytes of several tribes, built forts and castles, and lived in villages. Judaism managed to playan important role in the pre-Islam political life. When Islam dawned on that land, there had alreadybeen several famous Jewish tribes — Khabeer, Al-Mustaliq, An-Nadeer, Quraizah and Qainuqa‘. Insome versions, the Jewish tribes counted as many as twenty.Judaism was introduced into Yemen by someone called As‘ad Abi Karb. He had gone to fight inYathrib and there he embraced Judaism and then went back taking with him two rabbis from BaniQuraizah to instruct thpeople of Yemen in this new religion. Judaism found a fertile soil there topropagate and gain adherents. After his death, his son Yusuf Dhu Nawas rose to power, attackedthe Christian community in Najran and ordered them to embrace Judaism. When they refused, heordered that a pit of fire be dug and all the Christians indiscriminately be dropped to burn therein.Estimates say that between 20-40 thousand Christians were killed in that human massacre. TheQur’ân related part of that story in Al-Buruj (zodiacal signs) Chapter.Christianity had first made its appearance in Arabia following the entry of the Abyssinian (Ethiopian)and Roman colonists into that country. The Abyssinian (Ethiopian) colonization forces in league withChristian missions entered Yemen as a retaliatory reaction for the iniquities of Dhu Nawas, andstarted vehemently to propagate their faith ardently. They even built a church and called it YemeniAl-Ka‘bah with the aim of directing the Arab pilgrimage caravans towards Yemen, and then made anattempt to demolish the Sacred House in Makkah. Allâh, the Almighty, however did punish them andmade an example of them – here and hereafter.A Christian missionary called Fimion, and known for his ascetic behaviour and working miracles, hadlikewise infiltrated into Najran. There he called people to Christianity, and by virtue of his honestyand truthful devotion, he managed to persuade them to respond positively to his invitation andembrace Christianity.The principal tribes that embraced Christianity were Ghassan, Taghlib, Tai’ and some Himyaritekings as well as other tribes living on the borders of the Roman Empire.Magianism was also popular among the Arabs living in the neighbourhood of Persia, Iraq, Bahrain,Al-Ahsâ’ and some areas on the Arabian Gulf coast. Some Yemenis are also reported to haveprofessed Magianism during the Persian occupation.As for Sabianism, excavations in Iraq revealed that it had been popular amongst Kaldanian folks,the Syrians and Yemenis. With the advent of Judaism and Christianity, however, Sabianism began togive way to the new religions, although it retained some followers mixed or adjacent to the Magiansin Iraq and the Arabian Gulf."
                }
            ]
        },
        {
            "section": "Aspects of Pre-Islamic Arabian Society",
            "content": "",
            "sub_sections":[
                {
                    "sub_section": "Social life of the Arabs",
                    "content": "The Arabian Society presented a social medley, with different and heterogeneous social strata. Thestatus of the woman among the nobility recorded an advanced degree of esteem. The womanenjoyed a considerable portion of free will, and her decision would most often be enforced. She wasso highly cherished that blood would be easily shed in defence of her honour. In fact, she was themost decisive key to bloody fight or friendly peace. These privileges notwithstanding, the familysystem in Arabia was wholly patriarchal. The marriage contract rested completely in the hands ofthe woman’s legal guardian whose words with regard to her marital status could never bequestioned.On the other hand, there were other social strata where prostitution and indecency were rampantand in full operation. Abu Da’ûd, on the authority of ‘Aishah(May Allah be pleased with her)reported four kinds of marriage in pre-Islamic Arabia: The first was similar to present-day marriageprocedures, in which case a man gives his daughter in marriage to another man after a dowry hasbeen agreed on. In the second, the husband would send his wife – after the menstruation period –to cohabit with another man in order to conceive. After conception her husband would, if he desired,have a sexual intercourse with her. A third kind was that a group of less than ten men would havesexual intercourse with a woman. If she conceived and gave birth to a child, she would send forthese men, and nobody could abstain. They would come together to her house. She would say: ‘Youknow what you have done. I have given birth to a child and it is your child’ (pointing to one ofthem). The man meant would have to accept. The fourth kind was that a lot of men would havesexual intercourse with a certain woman (a whore). She would not prevent anybody. Such womenused to put a certain flag at their gates to invite in anyone who liked. If this whore got pregnant andgave birth to a child, she would collect those men, and a seeress would tell whose child it was. Theappointed father would take the child and declare him/her his own. When Prophet Muhammad(Peace be upon him) declared Islam in Arabia, he cancelled all these forms of sexual contacts exceptthat of present Islamic marriage Women always accompanied men in their wars. The winners would freely have sexual intercoursewith such women, but disgrace would follow the children conceived in this way all their lives.Pre-Islam Arabs had no limited number of wives. They could marry two sisters at the same time, oreven the wives of their fathers if divorced or widowed. Divorce was to a very great extent in thepower of the husband.The obscenity of adultery prevailed almost among all social classes except few men and womenwhose self-dignity prevented them from committing such an act. Free women were in much betterconditions than the female slaves who constituted the greatest calamity. It seemed that the greatestmajority of pre-Islam Arabs did not feel ashamed of committing this obscenity. Abu Da’ûd reported:A man stood up in front of Prophet Muhammad (Peace be upon him) and said: “O Prophet of Allâh!that boy is my son. I had sexual intercourse with his mother in the pre-Islamic period.” The Prophet(Peace be upon him) said  · “No claim in Islam for pre-Islamic affairs. The child is to be attributed to the one on whosebed it was born, and stoning is the lot of a fornicator.” With respect to the pre-Islam Arab’s relation with his offspring, we see that life in Arabia wasparadoxical and presented a gloomy picture of contrasts. Whilst some Arabs held children dear totheir hearts and cherished them greatly, others buried their female children alive because an illusoryfear of poverty and shame weighed heavily on them. The practice of infanticide cannot, however, beseen as irrevocably rampant because of their dire need for male children to guard themselvesagainst their enemies.Another aspect of the Arabs’ life which deserves mention is the bedouin’s deep-seated emotionalattachment to his clan. Family, or perhaps tribal-pride, was one of the strongest passions with him.The doctrine of unity of blood as the principle that bound the Arabs into a social unity was formedandsupported by tribal-pride. Their undisputed motto was: “ÇäÕÑ ÃÎÇß ÙÇáãÇ Ãæ ãÙáæãÇ —Support your brother whether he is an oppressor or oppressed” in its literal meaning; theydisregarded the Islamic amendment which states that supporting an oppressor brother impliesdeterring him from transgression. Avarice for leadership, and keen sense of emulation often resulted in bitter tribal warfare despitedescendency from one common ancestor. In this regard, the continued bloody conflicts of Aws andKhazraj, ‘Abs and Dhubyan, Bakr and Taghlib, etc. are striking examples.Inter-tribal relationships were fragile and weak due to continual inter-tribal wars of attrition. Deepdevotion to religious superstitions and some customs held in veneration, however, used to curb theirimpetuous tendency to quench their thirst for b lood. In other cases, there were the motives of, andrespect for, alliance, loyalty and dependency which could successfully bring about a spirit of rapport,and abort groundless bases of dispute. A time -honoured custom of suspending hostilities during theprohibited months (Muharram, Rajab, Dhul-Qa‘dah, and Dhul-Hijjah) functioned favourably andprovided an opportunity for them to earn their living and coexist in peace.We may sum up the social situation in Arabia by saying that the Arabs of the pre-Islamic periodwere groping about in the dark and ignorance, entangled in a mesh of superstitions paralyzing theirmind and driving them to lead an animal-like life. The woman was a marketable commodity andregarded as a piece of inanimate property. Inter-tribal relationships were fragile. Avarice for wealthand involvement in futile wars were the main objectives that governed their chiefs’ self-centredpolicies."
                },
                {
                    "sub_section":"The Economic Situation",
                    "content":"The economic situation ran in line with the social atmosphere. The Arabian ways of living wouldillustrate this phenomenon quite clearly. Trade was the most common means of providing theirneeds of life. The trade journeys could not be fulfilled unless security of caravan routes and intertribalpeaceful co-existence were provided – two imperative exigencies unfortunately lacking inArabia except during the prohibited months within which the Arabs held their assemblies of ‘Ukaz,Dhil-Majaz, Mijannah and others. Industry was alien to the Arabian psychology. Most of available industries of knitting and tannage inArabia were done by people coming from Yemen, Heerah and the borders of Syria. Inside Arabiathere was some sort of farming and stock-breeding. Almost all the Arabian women worked in yarnspinning but even this practice was continually threatened by wars. On the whole, poverty, hungerand insufficient clothing were the prevailing features in Arabia, economically.ETHICS: We cannot deny that the pre-Islam Arabs had such a large bulk of evils. Admittedly, vices and evils,utterly rejected by reason, were rampant amongst the pre-Islam Arabs, but this could never screenoff the surprise-provoking existence of highly praiseworthy virtues, of which we could adduce thefollowing: 1. Hospitality: They used to emulate one another at hospitality and take utmost pride in it.Almost half of their poetry heritage was dedicated to the merits and nobility attached toentertaining one’s guest. They were generous and hospitable on the point of fault. Theywould sacrifice their private sustenance to a cold or hungry guest. They would not hesitateto incur heavy blood-money and relevant burdens just to stop blood-shed, and consequentlymerit praise and eulogy. 2. In the context of hospitality, there springs up their common habits of drinking wine whichwas regarded as a channel branching out of generosity and showing hospitality. Winedrinking was a genuine source of pride for the Arabs of the pre-Islamic period. The greatpoets of that era never forgot to include their suspending odes the most ornate linespregnant with boasting and praise of drinking orgies. Even the word ‘grapes’ in Arabic is identical to generosity in both pronunciation and spelling. Gambling was also anotherpractice of theirs closely associated with generosity since the proceeds would always go tocharity. Even the Noble Qur’ân does not play down the benefits that derive from winedrinking and gambling, but also says, “And the sin of them is greater than their benefit.” [2:219] 3. Keeping a covenant: For the Arab, to make a promise was to run into debt. He would nevergrudge the death of his children or destruction of his household just to uphold the deeprootedtradition of covenant-keeping. The literature of that period is rich in storieshighlighting this merit. 4. Sense of honour and repudiation of injustice: This attribute stemmed mainly from excesscourage, keen sense of self-esteem and impetuosity. The Arab was always in revolt againstthe least allusion to humiliation or slackness. He would never hesitate to sacrifice himself tomaintain his ever alert sense of self-respect.5. Firm will and determination: An Arab would never desist an avenue conducive to an objectof pride or a standing of honour, even if it were at the expense of his life.6. Forbearance, perseverance and mildness: The Arab regarded these traits with greatadmiration, no wonder, his impetuosity and courage-based life was sadly wanting in them.7. Pure and simple bedouin life, still untarnished with accessories of deceptive urbanappearances, was a driving reason to his nature of truthfulness and honesty, anddetachment from intrigue and treachery. Such priceless ethics coupled with a favourable geographical position of Arabia were in fact thefactors that lay behind selecting the Arabs to undertake the burden of communicating the Message(of Islam) and leading mankind down a new course of life.In this regard, these ethics per se, though detrimental in some areas, and in need of rectification incertain aspects, were greatly invaluable to the ultimate welfare of the human community and Islamhas did it completely.The most priceless ethics, next to covenant-keeping, were no doubt their sense of self-esteem andstrong determination, two human traits indispensable in combatting evil and eliminating moralcorruption on the one hand, and establishing a good and justice-orientated society, on the other.Actually, the life of the Arabs in the pre-Islamic period was rich in other countless virtues we do notneed to enumerate for the time being."
                }
            ]
        },
        {
            "section":"The Lineage and Family of Muhammad (Peace be upon him)",
            "sub_sections":[{
                "sub_section": "The Lineage",
                "content":"With respect to the lineage of Prophet Muhammad (Peace be upon him), there are three versions:The first was authenticated by biographers and genealogists and states that Muhammad’s genealogyhas been traced to ‘Adnan. The second is subject to controversies and doubt, and traces his lineagebeyond ‘Adnan back to Abraham. The third version, with some parts definitely incorrect, traces hislineage beyond Abraham back to Adam (Peace be upon him)After this rapid review, now ample details are believed to be necessary.The first part: Muhammad bin ‘Abdullah bin ‘Abdul-Muttalib (who was called Shaiba) bin Hashim,(named ‘Amr) bin ‘Abd Munaf (called Al-Mugheera) bin Qusai (also called Zaid) bin Kilab bin Murrabin Ka‘b bin Lo’i bin Ghalib bin Fahr (who was called Quraish and whose tribe was called after him)bin Malik bin An-Nadr (so called Qais) bin Kinana bin Khuzaiman bin Mudrikah (who was called‘Amir) bin Elias bin Mudar bin Nizar bin Ma‘ad bin ‘Adnan.The second part: ‘Adnan bin Add bin Humaisi‘ bin Salaman bin Aws bin Buz bin Qamwal bin Obai bin‘Awwam bin Nashid bin Haza bin Bildas bin Yadlaf bin Tabikh bin Jahim bin Nahish bin Makhi bin Aidbin ‘Abqar bin ‘Ubaid bin Ad-Da‘a bin Hamdan bin Sanbir bin Yathrabi bin Yahzin bin Yalhan binAr‘awi bin Aid bin Deshan bin Aisar bin Afnad bin Aiham bin Muksar bin Nahith bin Zarih bin Samibin Mazzi bin ‘Awda bin Aram bin Qaidar bin Ishmael son of Abraham (Peace be upon them). The third part: beyond Abraham (Peace be upon him) , Ibn Tarih (Azar) bin Nahur bin Saru‘ bin Ra‘ubin Falikh bin Abir bin Shalikh bin Arfakhshad bin Sam bin Noah (Peace be upon him) , bin Lamik binMutwashlack bin Akhnukh [who was said to be Prophet Idris (Enoch) (Peace be upon him) binYarid bin Mahla’il bin Qabin Anusha bin Shith bin Adam (Peace be upon him) THE PROPHETIC FAMILY:The family of Prophet Muhammad (Peace be upon him) is called the Hashimite family after hisgrandfather Hashim bin ‘Abd Munaf. Let us now speak a little about Hashim and his descendants: 1. Hashim: As we have previously mentioned, he was the one responsible for giving food andwater to the pilgrims. This had been his charge when the sons of ‘Abd Munaf and those of‘Abd Ad-Dar compromised on dividing the charges between them. Hashim was wealthy andhonest. He was the first to offer the pilgrims sopped bread in broth. His first name was ‘Amrbut he was called Hashim because he had been in the practice of crumbling bread (for thepilgrims). He was also the first man who started Quraish’s two journeys of summer andwinter. It was reported that he went to Syria as a merchant. In Madinah, he married Salma— the daughter of ‘Amr from Bani ‘Adi bin An-Najjar. He spent some time with her inMadinah then he left for Syria again while she was pregnant. He died in Ghazza in Palestinein 497 A.D. Later, his wife gave birth to ‘Abdul-Muttalib and named him Shaiba for the whitehair in his head , and brought him up in her father’s house in Madinah. None of his family inMakkah learned of his birth. Hashim had four sons; Asad, Abu Saifi, Nadla and ‘Abdul-Muttalib, and five daughters Ash-Shifa, Khalida, Da‘ifa, Ruqyah and Jannah.2. ‘Abdul-Muttalib: We have already known that after the death of Hashim, the charge ofpilgrims’ food and water went to his brother Al-Muttalib bin ‘Abd Munaf (who was honest,generous and trustworthy). When ‘Abdul-Muttalib reached the age of boyhood, his uncle Al-Muttalib heard of him and went to Madinah to fetch him. When he saw him, tears filled hiseyes and rolled down his cheeks, he embraced him and took him on his camel. The boy,however abstained from going with him to Makkah until he took his mother’s consent. Al-Muttalib asked her to send the boy with him to Makkah, but she refused. He managed toconvince her saying: “Your son is going to Makkah to restore his father’s authority, and tolive in the vicinity of the Sacred House.” There in Makkah, people wondered at seeing Abdul-Muttalib, and they considered him the slave of Muttalib. Al-Muttalib said: “He is my nephew,the son of my brother Hashim.” The boy was brought up in Al-Muttalib’s house, but later onAl-Muttalib died in Bardman in Yemen so ‘Abdul-Muttalib took over and managed to maintainhis people’s prestige and outdo his grandfathers in his honourable behaviour which gainedhim Makkah’s deep love and high esteem.3. When Al-Muttalib died, Nawfal usurped ‘Abdul-Muttalib of his charges, so the latter asked forhelp from Quraish but they abstained from extending any sort of support to either of them.Consequently, he wrote to his uncles of Bani An-Najjar (his mother’s brothers) to come tohis aid. His uncle, Abu Sa‘d bin ‘Adi (his mother’s brother) marched to Makkah at the headof eighty horsemen and camped in Abtah in Makkah. ‘Abdul-Muttalib received the men andinvited them to go to his house but Abu Sa‘d said: “Not before I meet Nawfal.” He foundNawfal sitting with some old men of Quraish in the shade of Al-Ka‘bah. Abu Sa‘d drew hissword and said: “I swear by Allâh that if you don’t restore to my nephew what you havetaken, I will kill you with this sword.” Nawfal was thus forced to give up what he hadusurped, and the notables of Quraish were made to witness to his words. Abu Sa‘d thenwent to ‘Abdul-Muttalib’s house where he stayed for three nights, made ‘Umra a nd left backfor Madinah. Later on, Nawfal entered into alliance with Bani ‘Abd Shams bin ‘Abd Munafagainst Bani Hashim. When Khuza‘a, a tribe, saw Bani An-Najjar’s support to ‘Abdul-Muttalibthey said: “He is our son as he is yours. We have more reasons to support him than you.”‘Abd Munaf’s mother was one of them. They went into An-Nadwa House and entered intoalliance with Bani Hashim against Bani ‘Abd Shams and Nawfal. It was an alliance that waslater to constitute the main reason for the conquest of Makkah. ‘Abdul-Muttalib witnessedtwo important events in his lifetime, namely digging Zamzam well and the Elephant raid.In brief, ‘Abdul-Muttalib received an order in his dream to dig Zamzam well in a particularplace. He did that and found the things that Jurhum men had buried therein when they wereforced to evacuate Makkah. He found the swords, armours and the two deer of gold. Thegate of Al-Ka‘bah was stamped from the gold swords and the two deer and then thetradition of providing Zamzam water to pilgrims was established.When the well of Zamzam gushed water forth, Quraish made a claim to partnership in theenterprise, but ‘Abdul-Muttalib refused their demands on grounds that Allâh had singled onlyhim out for this honourable job. To settle the dispute, they agreed to consult Bani Sa‘d’sdiviner. On their way, Allâh showed them His Signs that confirmed ‘Abdul-Muttalib’sprerogative as regards the sacred spring. Only then did ‘Abdul-Muttalib make a solemn vowto sacrifice one of his adult children to Al-Ka‘bah if he had ten. The second event was that of Abraha As-Sabah Al-Habashi, the Abyssinian (Ethiopian)viceroy in Yemen. He had seen that the Arabs made their pilgrimage to Al-Ka‘bah so he builta large church in San‘a in order to attract the Arab pilgrims to it to the exclusion of Makkah.A man from Kinana tribe understood this move, therefore he entered the church stealthily atnight and besmeared its front wall with excrement. When Abraha knew of that, he got veryangry and led a great army – of sixty thousand warriors – to demolish Al-Ka‘bah. He chosethe biggest elephant for himself. His army included nine or thirteen elephants. He continuedmarching until he reached a place called Al-Magmas. There, he mobilized his army, preparedhis elephants and got ready to enter Makkah. When he reached Muhassar Valley, betweenMuzdalifah and Mina, the elephant knelt down and refused to go forward. Whenever theydirected it northwards, southwards or eastwards, the elephant moved quickly but whendirected westwards towards Al-Ka‘bah, it knelt down. Meanwhile, Allâh loosed upon thembirds in flights, hurling against them stones of baked clay and made them like green bladesdevoured. These birds were very much like swallows and sparrows, each carrying threestones; one in its peak and two in its claws. The stones hit Abraha’s men and cut their limbsand killed them. A large number of Abraha’s soldiers were killed in this way and the othersfled at random and died everywhere. Abraha himself had an infection that had his fingertipsamputated. When he reached San‘a he was in a miserable state and died soon after.The Quraishites on their part had fled for their lives to the hillocks and mountain tops. Whenthe enemy had been thus routed, they returned home safely.The Event of the Elephant took place in the month of Al-Muharram, fifty or fifty five daysbefore the birth of Prophet Muhammad (Peace be upon him) which corresponded to lateFebruary or early March 571 A.D. It was a gift from Allâh to His Prophet and his family. Itcould actually be regarded as a Divine auspicious precursor of the light to come andaccompany the advent of the Prophet and his family. By contrast, Jerusalem had sufferedunder the yoke of the atrocities of Allâh’s enemies. Here we can recall Bukhtanassar in B.C. 587 and the Romans in 70 A.D. Al-Ka‘bah, by Divine Grace, never came under the hold ofthe Christians – the Muslims of that time – although Makkah was populated by polytheists. News of the Elephant Event reached the most distant corners of the then civilized world.Abyssinia (Ethiopia) maintained strong ties with the Romans, while the Persians on the otherhand, were on the vigil with respect to any strategic changes that were looming on thesocio-political horizon, and soon came to occupy Yemen. Incidentally, the Roman andPersian Empires stood for the powerful civilized world at that time. The Elephant Raid Eventriveted the world’s attention to the sacredness of Allâh’s House, and showed that this Househad been chosen by Allâh for its ho. It followed then if any of its people claimedProphethood, it would be congruous with the outcome of the Elephant Event, and wouldprovide a justifiable explanation for the ulterior Divine Wisdom that lay behind backingpolytheists against Christians in a manner that transcended the cause-and-effect formula. ‘Abdul-Muttalib had ten sons, Al-Harith, Az-Zubair, Abu Talib, ‘Abdullah, Hamzah, AbuLahab, Ghidaq, Maqwam, Safar and Al-‘Abbas. He also had six daughters, who were UmmAl-Hakim – the only white one, Barrah, ‘Atikah, Safiya, Arwa and Omaima. 4. ‘Abdullah: The father of Prophet Muhammad (Peace be upon him). His mother was Fatimah,daughter of ‘Amr bin ‘A’idh bin ‘Imran bin Makhzum bin Yaqdha bin Murra. ‘Abdullah was thesmartest of ‘Abdul-Muttalib’s sons, the chastest and the most loved. He was also the sonwhom the divination arrows pointed at to be slaughtered as a sacrifice to Al-Ka‘bah. When‘Abdul-Muttalib had ten sons and they reached maturity, he divulged to them his secret vowin which they silently and obediently acquiesced. Their names were written on divinationarrows and given to the guardian of their most beloved goddess, Hubal. The arrows wereshuffled and drawn. An arrow showed that it was ‘Abdullah to be sacrificed. ‘Abdul-Muttalibthen took the boy to Al-Ka‘bah with a razor to slaughter the boy. Quraish, his uncles fromMakhzum tribe and his brother Abu Talib, however, tried to dissuade him fromconsummating his purpose. He then sought their advice as regards his vow. They suggestedthat he summon a she-diviner to judge whereabout. She ordered that the divination arrowsshould be drawn with respect to ‘Abdullah as well as ten camels. She added that drawing thelots should be repeated with ten more camels every time the arrow showed ‘Abdullah. Theoperation was thus repeated until the number of the camels amounted to one hundred. Atthis point the arrow showed the camels, consequently they were all slaughtered (to thesatisfaction of Hubal) instead of his son. The slaughtered camels were left for anyone to eatfrom, human or animal. · This incident produced a change in the amount of blood-money usually accepted inArabia. It had been ten camels, but after this event it was increased to a hundred. Islam,later on, approved of this. Another thing closely relevant to the above issue goes to theeffect that the Prophet (Peace be upon him) once said: “I am the offspring of the slaughtered two,” meaning Ishmael and ‘Abdullah.‘Abdul-Muttalib chose Amina, daughter of Wahab bin ‘Abd Munaf bin Zahra bin Kilab, as a wife forhis son, ‘Abdullah. She thus, in the light of this ancestral lineage, stood eminent in respect ofnobility of position and descent. Her father was the chief of Bani Zahra to whom great honour wasattributed. They were married in Makkah, and soon after ‘Abdullah was sent by his father to buydates in Madinah where he died. In another version, ‘Abdullah went to Syria on a trade journey anddied in Madinah on his way back. He was buried in the house of An-Nabigha Al-Ju‘di. He was twentyfiveyears old when he died. Most historians state that his death was two months before the birth ofMuhammad Õáì Çááå Úáíå æÓáã . Some others said that his death was two months after theProphet’s birth. When Amina was informed of her husband’s death, she celebrated his memory in amost heart-touching elegy.‘Abdullah left very little wealth —five camels, a small number of goats, a she-servant, called Barakah – Umm Aiman – who would later serve as the Prophet’s nursemaid. "
            }]
        },
        {
            "section": "Muhammad’s Birth and Forty years prior Prophethood",
            "content":"",
            "sub_sections":[
                {
                    "sub_section": "His Birth",
                    "content": "Muhammad (Peace be upon him), the Master of Prophets, was born in Bani Hashim lane in Makkahon Monday morning, the ninth of Rabi‘ Al-Awwal, the same year of the Elephant Event, and fortyyears of the reign of Kisra (Khosru Nushirwan), i.e. the twentieth or twenty-second of April, 571A.D., according to the scholar Muhammad Sulaimân Al-Mansourpuri, and the astrologer MahmûdPasha. Ibn Sa‘d reported that Muhammad’s mother said: “When he was born, there was a light that issuedout of my pudendum and lit the palaces of Syria.” Ahmad reported on the authority of ‘Arbadh binSariya something similar to this. It was but controversially reported that significant precursors accompanied his birth: fourteengalleries of Kisra’s palace cracked and rolled down, the Magians’ sacred fire died down and somechurches on Lake Sawa sank down and collapsed. His mother immediately sent someone to inform his grandfather ‘Abdul-Muttalib of the happy event.Happily he came to her, carried him to Al-Ka‘bah, prayed to Allâh and thanked Him. ‘Abdul-Muttalibcalled the baby Muhammad, a name not then common among the Arabs. He circumcised him on hisseventh day as was the custom of the Arabs. The first woman who suckled him after his mother was Thuyebah, the concubine of Abu Lahab, withher son, Masrouh. She had suckled Hamzah bin ‘Abdul-Muttalib before and later Abu Salamah bin‘Abd Al-Asad Al-Makhzumi"
                },
                {
                    "sub_section": "Babyhood",
                    "content": "It was the general custom of the Arabs living in towns to send their children away to bedouin wetnurses so that they might grow up in the free and healthy surroundings of the desert whereby theywould develop a robust frame and acquire the pure speech and manners of the bedouins, who werenoted both for chastity of their language and for being free from those vices which usually developin sedentary societies.The Prophet (Peace be upon him) was later entrusted to Haleemah bint Abi Dhuaib from Bani Sa‘dbin Bakr. Her husband was Al-Harith bin ‘Abdul ‘Uzza called Abi Kabshah, from the same tribe. Muhammad (Peace be upon him) had several foster brothers and sisters, ‘Abdullah bin Al-Harith,Aneesah bint Al-Harith, Hudhafah or Judhamah bint Al-Harith (known as Ash-Shayma’), and sheused to nurse the Prophet (Peace be upon him) and Abu Sufyan bin Al-Harith bin ‘Abdul-Muttalib,the Prophet’s cousin. Hamzah bin ‘Abdul-Muttalib, the Prophet’s uncle, was suckled by the same twowet nurses, Thuyeba and Haleemah As-Sa‘diyah, who suckled the Prophet (Peace be upon him) Traditions delightfully relate how Haleemah and the whole of her household were favoured bysuccessive strokes of good fortune while the baby Muhammad (Peace be upon him) lived under hercare. Ibn Ishaq states that Haleemah narrated that she along with her husband and a suckling babe,set out from her village in the company of some women of her clan in quest of children to suckle.She said: It was a year of drought and famine and we had nothing to eat. I rode on a brown she-ass. We alsohad with us an old she-camel. By Allâh we could not get even a drop of milk. We could not have awink of sleep during the night for the child kept crying on account of hunger. There was not enoughmilk in my breast and even the she-camel had nothing to feed him. We used to constantly pray forrain and immediate relief. At length we reached Makkah looking for children to suckle. Not even asingle woman amongst us accepted the Messenger of Allâh (Peace be upon him) offered to her. Assoon as they were told that he was an orphan, they refused him. We had fixed our eyes on thereward that we would get from the child’s father. An orphan! What are his grandfather and motherlikely to do? So we spurned him because of that. Every woman who came with me got a sucklingand when we were about to depart, I said to my husband: “By Allâh, I do not like to go back alongwith the other women without any baby. I should go to that orphan and I must take him.” He said,“There is no harm in doing so and perhaps Allâh might bless us through him.” So I went and tookhim because there was simply no other alternative left for me but to take him. When I lifted him inmy arms and returned to my place I put him on my breast and to my great surprise, I found enoughmilk in it. He drank to his heart’s content, and so did his foster brother and then both of them wentto sleep although my baby had not been able to sleep the previous night. My husband then went tothe she-camel to milk it and, to his astonishment, he found plenty of milk in it. He milked it and wedrank to our fill, and enjoyed a sound sleep during the night. The next morning, my husband said:“By Allâh Haleemah, you must understand that you have been able to get a blessed child.” And Ireplied: “By the grace of Allâh, I hope so.” The tradition is explicit on the point that Haleemah’s return journey and her s ubsequent life, as longas the Prophet (Peace be upon him)stayed with her, was encircled with a halo of good fortune. Thedonkey that she rode when she came to Makkah was lean and almost foundered; it recovered speedmuch to the amazement of Haleemah’s fellow travellers. By the time they reached theencampments in the country of the clan of Sa‘d, they found the scales of fortune turned in theirfavour. The barren land sprouted forth luxuriant grass and beasts came back to them satisfied andfull of milk. Muhammad (Peace be upon him) stayed with Haleemah for two years until he wasweaned as Haleemah said: We then took him back to his mother requesting her earnestly to have him stay with us and benefitby the good fortune and blessings he had brought us. We persisted in our request which wesubstantiated by our anxiety over the child catching a certain infection peculiar to Makkah. At last,we were granted our wish and the Prophet (Peace be upon him) stayed with us until he was four orfive years of age. When, as related by Anas in Sahih Muslim, Gabriel came down and ripped his chest open and tookout the heart. He then extracted a blood-clot out of it and said: “That was the part of Satan in thee.”And then he washed it with the water of Zamzam in a gold basin. After that the heart was joinedtogether and restored to its place. The boys and playmates came running to his mother, i.e. hisnurse, and said: “Verily, Muhammad (Peace be upon him) has been murdered.” They all rushedtowards him and found him all right only his face was white"
                },
                {
                    "sub_section":"Back to his passionate Mother",
                    "content":"After this event, Haleemah was worried about the boy and returned him to his mother with whomhe stayed until he was six. In respect of the memory of her late husband, Amina decided to visit h is grave in Yathrib (Madinah).She set out to cover a journey of 500 kilometers with her orphan boy, woman servant Umm Aymanand her father-in-law ‘Abdul-Muttalib. She spent a month there and then took her way back toMakkah. On the way, she had a severe illness and died in Abwa on the road between Makkah andMadinah."   
                },
                {
                    "sub_section": "To His compassionate Grandfather",
                    "content": "Abdul-Muttalib brought the boy to Makkah. He had warm passions towards the boy, his orphangrandson, whose recent disaster (his mother’s death) added more to the pains of the past. ‘Abdul-Muttalib was more passionate with his grandson than with his own children. He never left the boy aprey to loneliness, but always preferred him to his own kids. Ibn Hisham reported: A mattress wasput in the shade of Al-Ka‘bah for ‘Abdul-Muttalib. His children used to sit around that mattress inhonour to their father, but Muhammad (Peace be upon him) used to sit on it. His uncles would takehim back, but if ‘Abdul-Muttalib was present, he would say: “Leave my grandson. I swear by Allâhthat this boy will hold a significant position.” He used to seat the boy on his mattress, pat his backand was always pleased with what the boy did. <br/>‘Abdul-Muttalib brought the boy to Makkah. He had warm passions towards the boy, his orphangrandson, whose recent disaster (his mother’s death) added more to the pains of the past. ‘Abdul-Muttalib was more passionate with his grandson than with his own children. He never left the boy aprey to loneliness, but always preferred him to his own kids. Ibn Hisham reported: A mattress wasput in the shade of Al-Ka‘bah for ‘Abdul-Muttalib. His children used to sit around that mattress inhonour to their father, but Muhammad (Peace be upon him) used to sit on it. His uncles would takehim back, but if ‘Abdul-Muttalib was present, he would say: “Leave my grandson. I swear by Allâhthat this boy will hold a significant position.” He used to seat the boy on his mattress, pat his backand was always pleased with what the boy did.When Muhammad (Peace be upon him) was eight years, two months and ten days old, hisgrandfather ‘Abdul-Muttalib passed away in Makkah. The charge of the Prophet (Peace be upon him)was now passed on to his uncle Abu Talib, who was the brother of the Prophet’s father. <br/> Abu Talib tookthe charge of his nephew in the best way. He put him with his children and preferredhim to them. He singled the boy out with great respect and high esteem. Abu Talib remained forforty years cherishing his nephew and extending all possible protection and support to him. Hisrelations with the others were determined in the light of the treatment they showed to the Prophet(Peace be upon him)<br/>. Abu Talib tookthe charge of his nephew in the best way. He put him with his children and preferredhim to them. He singled the boy out with great respect and high esteem. Abu Talib remained forforty years cherishing his nephew and extending all possible protection and support to him. Hisrelations with the others were determined in the light of the treatment they showed to the Prophet(Peace be upon him).<br/>Ibn ‘Asakir reported on the authority of Jalhamah bin ‘Arfuta who said: “I came to Makkah when itwas a rainless year, so Quraish said ‘O Abu Talib, the valley has become leafless and the childrenhungry, let us go and pray for rain-fall.’ Abu Talib went to Al-Ka‘bah with a young boy who was asbeautiful as the sun, and a black cloud was over his head. Abu Talib and the boy stood by the wall ofAl-Ka‘bah and prayed for rain. Immediately clouds from all directions gathered and rain fell heavilyand caused the flow of springs and growth of plants in the town and the country. "
                },
                {
                    "sub_section":"Bahira, the Monk",
                    "content": "When the Messenger of Allâh (Peace be upon him) was twelve years old, he went with his uncle Abu Talib on a business journey to Syria. When they reached Busra (which was a part of Syria, in the vicinity of Howran under the Roman domain) they met a monk called Bahira (his real name was Georges), who showed great kindness, and entertained them lavishly. He had never been in the habit of receiving or entertaining them before. He readily enough recognized the Prophet (Peace be upon him) and said while taking his hand: “This is the master of all humans. Allâh will send him with a Message which will be a mercy to all beings.” Abu Talib asked: “How do you know that?” He replied: “When you appeared from the direction of ‘Aqabah, all stones and trees prostrated themselves, which they never do except for a Prophet. I can recognize him also by the seal of Prophethood which is below his shoulder, like an apple. We have got to learn this from our books.” He also asked Abu Talib to send the boy back to Makkah and not to take him to Syria for fear of the Jews. Abu Talib obeyed and sent him back to Makkah with some of his men servants"
                },
                {
                    "sub_section": "The Sacrilegious wars",
                    "content":"Muhammad (Peace be upon him) was hardly fifteen when the ‘sacrilegious’ wars — which continuedwith varying fortunes and considerable loss of human life for a number of years — broke outbetween Quraish and Banu Kinana on the one side and Qais ‘Ailan tribe on the other. It was thuscalled because the inviolables were made violable, the prohibited months being included. Harb binOmaiyah, on account of his outstanding position and honourable descent, used to be the leader ofQuraish and their allies. In one of those battles, the Prophet (Peace be upon him) attended on hisuncles but did not raise arms against their opponents. His efforts were confined to picking up thearrows of the enemy as they fell, and handing them over to his uncles."
                },
                {
                    "sub_section": "Al-Fudoul confederacy",
                    "content": "At the conclusion of these wars, when peace was restored, people felt the need for formingconfederacy at Makkah for suppressing violence and injustice, and vindicating the rights of the weakand the destitute. Representatives of Banu Hashim, Banu Al-Muttalib, Asad bin ‘Abd Al-‘Uzza,Zahrah bin Kilab and Taim bin Murra were called to meet in the habitation of an honourable elderlyman called ‘Abdullah bin Jada‘an At-Taimy to enter into a confederacy that would provide for theabove-mentioned items. The Messenger of Allâh (Peace be upon him) shortly after he had beenhonoured with the ministry of Prophethood, witnessed this league and commented on it, with verypositive words: “I witnessed a confederacy in the house of ‘Abdullah bin Jada‘an. It was moreappealing to me than herds of cattle. Even now in the period of Islam I would respond positively toattending such a meeting if I were invited. <br/> In fact, the spirit of this confederacy and the course of deliberations therein marked a completedeparture from the pre-Islamic tribal-pride. The story that led to its convention says that a manfrom Zubaid clan came as a merchant to Makkah where he sold some commodities to Al-‘As bin WailAs-Sahmy. The latter by hook or by crook tried to evade paying for the goods. The salesman soughthelp from the different clans in Quraish but they paid no heed to his earnest pleas. He then resortedto a mountain top and began, at the top of his voice, to recite verses of complaint giving account ofthe injustices he sustained. Az-Zubair bin ‘Abdul-Muttalib heard of him and made inquiries into thematter. Consequently, the parties to the aforesaid confederacy convened their meeting andmanaged to force Az-Zubaidy’s money out of Al-‘As bin Wa’il."
                },
                {
                    "sub_section": "Muhammad’s Early Job",
                    "content": "Muhammad (Peace be upon him), had no particular job at his early youth, but it was reported thathe worked as a shepherd for Bani Sa‘d and in Makkah. At the age of 25, he went to Syria as amerchant for Khadijah (May Allah be pleased with her) Ibn Ishaq reported that Khadijah, daughterof Khwailid was a business-woman of great honour and fortune. She used to employ men to do herbusiness for a certain percentage of the profits. Quraish people were mostly tradespeople, so whenKhadijah was informed of Muhammad (Peace be upon him), his truthful words, great honesty andkind manners, she sent for him. She offered him money to go to Syria and do her business, and shewould give him a higher rate than the others. She would also send her hireling, Maisarah, with him.He agreed and went with her servant to Syria for trade."

                },
                {
                    "sub_section": "His Marrige to Khadijah",
                    "content": "When he returned to Makkah, Khadijah noticed, in her money, more profits and blessings than sheused to. Her hireling also told her of Muhammad’s good manners, honesty, deep thought, sincerityand faith. She realized that she homed at her target. Many prominent men had asked for her handin marriage but she always spurned their advances. She disclosed her wish to her friend Nafisa,daughter of Maniya, who immediately went to Muhammad (Peace be upon him) and broke the goodnews to him. He agreed and requested his uncles to go to Khadijah’s uncle and talk on this issue.Subsequently, they were married. The marriage contract was witnessed by Bani Hashim and theheads of Mudar. This took place after the Prophet’s return from Syria. He gave her twenty camels asdowry. She was, then, forty years old and was considered as the best woman of her folk in lineage,fortune and wisdom. She was the first woman whom the Messenger of Allâh (Peace be upon him)married. He did not get married to any other until she had died.<br/>Khadijah bore all his children, except Ibrahim: Al-Qasim, Zainab, Ruqaiyah, Umm Kulthum, Fatimahand ‘Abdullah who was called Taiyib and Tahir. All his sons died in their childhood and all thedaughters except Fatimah died during his lifetime. Fatimah died six months after his death. All hisdaughters witnessed Islam, embraced it, and emigrated to Madinah."
                },
                {
                    "sub_section": "Rebuilding Al-Ka‘bah and the Arbitration Issue",
                    "content": "When the Messenger of Allâh (Peace be upon him) was thirty five, Quraish started rebuilding Al-Ka‘bah. That was because it was a low building of white stones no more than 6.30 metres high, fromthe days of Ishmael. It was also roofless and that gave the thieves easy access to its treasuresinside. It was also exposed to the wearing factors of nature — because it was built a long time ago— that weakened and cracked its walls. Five years before Prophethood, there was a great flood inMakkah that swept towards Al-Ka‘bah and almost demolished it. Quraish was obliged to rebuild it tosafeguard its holiness and position. The chiefs of Quraish decided to use only licit money inrebuilding Al-Ka‘bah, so all money that derived from harlotry, usury or unjust practices wasexcluded. They were, at first, too awed to knock down the wall, but Al-Waleed bin Al-Mugheerah Al-Mukhzumi started the work. Seeing that no harm had happened to him, the others participated indemolishing the walls until they reached the basis laid by Abraham. When they started rebuilding itswalls, they divided the work among the tribes. Each tribe was responsible for rebuilding a part of it.The tribes collected stones and startwork. The man who laid the stones was a Roman mason calledBaqum. The work went on in harmony till the time came to put the sacred Black Stone in its properplace. Then strife broke out among the chiefs, and lasted for four or five days, each contesting forthe honour of placing the stone in its position. Daggers were on the point of being drawn and greatbloodshed seemed imminent. Luckily, the oldest among the chiefs Abu Omaiyah bin Mugheerah Al-Makhzumi made a proposal which was accepted by all. He said: “Let him, who enters the Sanctuaryfirst of all, decide on the point.” It was then Allâh’s Will that the Messenger of Allâh (Peace be uponhim) should be the first to enter the Mosque. On seeing him, all the people on the scene, cried withone voice: “Al-Ameen (the trustworthy) has come. We are content to abide by his decision.” Calmand self-possessed, Muhammad (Peace be upon him) received the commission and at once resolvedupon an expedient which was to conciliate them all. He asked for a mantle which he spread on theground and placed the stone in its centre. He then asked the representatives of the different clansamong them, to lift the stone all together. When it had reached the proper place, Muhammad(Peace be upon him) laid it in the proper position with his own hands. This is how a very tensesituation was eased and a grave danger averted by the wisdom of the Prophet (Peace be upon him).Quraish ran short of the licit money, they collected, so they eliminated six yards area on thenorthern side of Al-Ka‘bah which is called Al-Hijr or Al-Hateem. They raised its door two metres fromthe level ground to let in only the people whom they desired. When the structure was fifteen yardshigh they erected the roof which rested on six columns.When the building of Al-Ka‘bah had finished, it assumed a square form fifteen metres high. The sidewith the Black Stone and the one opposite were ten metres long each. The Black Stone was 1.50metre from the circumambulation level ground. The two other sides were twelve metres long each.The door was two metres high from the level ground. A building structure of 0.25 metre high and0.30 metre wide on the average surrounded Al-Ka‘bah. It was called Ash-Shadherwan, originally anintegral part of the Sacred Sanctuary, but Quraish left it out."
                },
                {
                    "sub_section": "A Rapid Review of Muhammad’s Biography before commissioning of the Prophethood",
                    "content": "Prophet Muhammad (Peace be upon him) was, in his youth, a combination of the best socialattributes. He was an exemplary man of weighty mind and faultless insight. He was favoured withintelligence, originality of thought and accurate choice of the means leading to accurate goals. Hislong silence helped favourably in his habit of meditation and deep investigation into the truth. Hisvivid mind and pure nature were helpfully instrumental in assimilating and comprehending ways oflife and people, individual and community-wise. He shunned superstitious practices but took anactive part in constructive and useful dealings, otherwise, he would have recourse to his selfconsecratedsolitude. He kept himself aloof from drinking wine, eating meat slaughtered on stonealtars, or attending idolatrous festivals. He held the idols in extreme aversion and most abhorrence.He could never tolerate someone swearing by Al-Lat and Al-‘Uzza. Allâh’s providence, no doubts,detached him from all abominable or evil practices. Even when he tried to obey his instinct to enjoysome life pleasures or follow some irrespectable traditions, Allâh’s providence intervened to curb anylapse in this course. Ibn Al-Atheer reported Muhammad (Peace be upon him) as saying: “I havenever tried to do what my people do except for two times. Every time Allâh intervened and checkedme from doing so and I never did that again. Once I told my fellow-shepherd to take care of mysheep when we were in the upper part of Makkah. I wanted to go down to Makkah and entertainmyself as the young men did. I went down to the first house of Makkah where I heard music. Ientered and asked: ‘What is this?’ Someone answered: ‘It is a wedding party.’ I sat down andlistened but soon went into deep sleep. I was awakened by the heat of the sun. I went back to myfellow-shepherd and told him of what had happened to me. I have never tried it again.”Al-Bukhari reported on the authority of Jabir bin ‘Abdullah that he said: “While the people wererebuilding Al-Ka‘bah, the Prophet Muhammad (Peace be upon him) went with ‘Abbas to carry somestones. ‘Abbas said: ‘Put your loincloth round your neck to protect you from the stones.’ (As he didthat) the Prophet (Peace be upon him) fell to the ground and his eyes turned skyward. Later on hewoke up and shouted: ‘My loincloth... my loincloth.’ He wrapped himself in his loincloth.” In anotherreport: “His loins were never seen afterwards.”The authorities agree in ascribing to the youth of Muhammad (Peace be upon him) modesty ofdeportment, virtuous behaviour and graceful manners. He proved himself to be the ideal ofmanhood, and to possess a spotless character. He was the most obliging to his compatriots, themost honest in his talk and the mildest in temper. He was the most gentle-hearted, chaste,hospitable and always impressed people by his piety-inspiring countenance. He was the mosttruthful and the best to keep covenant. His fellow-citizens, by common consent, gave him the title ofAl-‘Ameen (trustworthy). The Mother of believers, Khadijah (May Allah be pleased with her) oncesaid: He unites uterine relations, he helps the poor and the needy, he entertains the guests andendures hardships in the path of truthfulness."
                }
            ]
        }
        
    ]
}